
SUMMERNOTE_THEME = 'bs4'
SUMMERNOTE_CONFIG = {
    'iframe': True,
    'summernote': {
        "colors": [
            ['#3056b8', '#f5d731', '#000', '#fff', '#dee2e6', '#ced4da', '#adb5bd', '#212529'],
            ['#0d6efd', '#6610f2', '#6f42c1','#d63384', '#dc3545', '#fd7e14', '#ffc107', '#198754'],
            ['#20c997', '#0dcaf0', '#495057', '#343a40', '#6c757d', '#343a40', '#f8f9fa', '#e9ecef'],
        ],
        "colorsName": [
            ['НАШ блакитний','НАШ жовтий', "Чорний", "Білий", "Сірий 30%", "Сірий 40%", "Сірий 50%", "Темний"],
            ["Блакитний", "Індіго", "Фіолетовий", "Рожевий", "Червоний", "Помаранчевий", "Жовтий", "Зелений"],
            ["Блакитний", "Голубий", "Сірий 70%", "Сірий 80%", "Сірий 60%", "Темний", "Світлий", "Сірий 20%"],
        ],
        'airMode': False,
        'width': '100%',
    },
    'css': ("/static/reua/css/bootstrap_overrides.css",),

}
